In [1]:
student={'Name':['Amandeep_Singh','Srajan_Jaiswal','Aman_Saraogi','Vibhor_Singh','Akki Sharma'],
          'Age':[20,21,19,20,'Na'],
          'Marks':[98,89,78,92,75],
          'Phoneno':[9878978,787898,7898789,'Na',88778988],
          'City':['Lucknow','Kanpur','Jhansi','Dehradun','Lucknow'],
          'email':['amandeep@gmail.com','jaiswalsrajan@gmail.com','aman@gmail.com','vibhu@gmail.com','Na']
        }

In [2]:
import pandas as pd
df=pd.DataFrame(student)

In [3]:
df

             Name Age  Marks   Phoneno      City                    email
0  Amandeep_Singh  20     98   9878978   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal  21     89    787898    Kanpur  jaiswalsrajan@gmail.com
2    Aman_Saraogi  19     78   7898789    Jhansi           aman@gmail.com
3    Vibhor_Singh  20     92        Na  Dehradun          vibhu@gmail.com
4     Akki Sharma  Na     75  88778988   Lucknow                       Na

In [4]:
df.columns        #name of all columns

Index(['Name', 'Age', 'Marks', 'Phoneno', 'City', 'email'], dtype='object')

In [5]:
filt=df['Name']=="Akki Sharma"
df.loc[filt]

          Name Age  Marks   Phoneno     City email
4  Akki Sharma  Na     75  88778988  Lucknow    Na

In [6]:
df['Marks'].median()

89.0

In [7]:
df.info

<bound method DataFrame.info of              Name Age  Marks   Phoneno      City                    email
0  Amandeep_Singh  20     98   9878978   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal  21     89    787898    Kanpur  jaiswalsrajan@gmail.com
2    Aman_Saraogi  19     78   7898789    Jhansi           aman@gmail.com
3    Vibhor_Singh  20     92        Na  Dehradun          vibhu@gmail.com
4     Akki Sharma  Na     75  88778988   Lucknow                       Na>

In [8]:
df['Age'].value_counts(20)

20    0.4
21    0.2
19    0.2
Na    0.2
Name: Age, dtype: float64

In [9]:
df.describe()          # gives ous quick overview about Bunch of data at the single unit.

           Marks
count   5.000000
mean   86.400000
std     9.659193
min    75.000000
25%    78.000000
50%    89.000000
75%    92.000000
max    98.000000

In [10]:
df['Age'].value_counts(20)

20    0.4
21    0.2
19    0.2
Na    0.2
Name: Age, dtype: float64

In [11]:
df['Name']

0    Amandeep_Singh
1    Srajan_Jaiswal
2      Aman_Saraogi
3      Vibhor_Singh
4       Akki Sharma
Name: Name, dtype: object

In [12]:
df.iloc[0]

Name           Amandeep_Singh
Age                        20
Marks                      98
Phoneno               9878978
City                  Lucknow
email      amandeep@gmail.com
Name: 0, dtype: object

In [13]:
df

             Name Age  Marks   Phoneno      City                    email
0  Amandeep_Singh  20     98   9878978   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal  21     89    787898    Kanpur  jaiswalsrajan@gmail.com
2    Aman_Saraogi  19     78   7898789    Jhansi           aman@gmail.com
3    Vibhor_Singh  20     92        Na  Dehradun          vibhu@gmail.com
4     Akki Sharma  Na     75  88778988   Lucknow                       Na

In [14]:
df['Name'].str.contains("Amandeep")          #check whether particluar name is present or not result in boolean

0     True
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [15]:
df['City'].str.contains("Lucknow").sum()

2

In [16]:
gr_data=df.groupby('Name')
gr_data.get_group('Amandeep_Singh')

             Name Age  Marks  Phoneno     City               email
0  Amandeep_Singh  20     98  9878978  Lucknow  amandeep@gmail.com

In [17]:
gr_data=df.groupby(['City','email'])
gr_data.get_group(('Lucknow','amandeep@gmail.com'))

             Name Age  Marks  Phoneno     City               email
0  Amandeep_Singh  20     98  9878978  Lucknow  amandeep@gmail.com

In [18]:
df['Marks'].mean()       #cal mean of Marks

86.4

In [19]:
df.sort_values(by='Name')

             Name Age  Marks   Phoneno      City                    email
4     Akki Sharma  Na     75  88778988   Lucknow                       Na
2    Aman_Saraogi  19     78   7898789    Jhansi           aman@gmail.com
0  Amandeep_Singh  20     98   9878978   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal  21     89    787898    Kanpur  jaiswalsrajan@gmail.com
3    Vibhor_Singh  20     92        Na  Dehradun          vibhu@gmail.com

In [20]:
df.sort_values(by='Name',ascending=False)

             Name Age  Marks   Phoneno      City                    email
3    Vibhor_Singh  20     92        Na  Dehradun          vibhu@gmail.com
1  Srajan_Jaiswal  21     89    787898    Kanpur  jaiswalsrajan@gmail.com
0  Amandeep_Singh  20     98   9878978   Lucknow       amandeep@gmail.com
2    Aman_Saraogi  19     78   7898789    Jhansi           aman@gmail.com
4     Akki Sharma  Na     75  88778988   Lucknow                       Na

In [21]:
df.sort_values(by=['Name','Age'],ascending=['True','False'])       #sort_values help in sorting

             Name Age  Marks   Phoneno      City                    email
4     Akki Sharma  Na     75  88778988   Lucknow                       Na
2    Aman_Saraogi  19     78   7898789    Jhansi           aman@gmail.com
0  Amandeep_Singh  20     98   9878978   Lucknow       amandeep@gmail.com
1  Srajan_Jaiswal  21     89    787898    Kanpur  jaiswalsrajan@gmail.com
3    Vibhor_Singh  20     92        Na  Dehradun          vibhu@gmail.com

In [22]:
df.info()         #info about rows,columns,dtype etc

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      object
 2   Marks    5 non-null      int64
 3   Phoneno  5 non-null      object
 4   City     5 non-null      object
 5   email    5 non-null      object
dtypes: int64(1), object(5)
memory usage: 368.0+ bytes

In [23]:
df['Name'].apply(len)                  #find len of Name

0    14
1    14
2    12
3    12
4    11
Name: Name, dtype: int64

In [24]:
df['email']=df['email'].apply(lambda x:x.upper())   # this will make email name upper case

In [25]:
df

             Name Age  Marks   Phoneno      City                    email
0  Amandeep_Singh  20     98   9878978   Lucknow       AMANDEEP@GMAIL.COM
1  Srajan_Jaiswal  21     89    787898    Kanpur  JAISWALSRAJAN@GMAIL.COM
2    Aman_Saraogi  19     78   7898789    Jhansi           AMAN@GMAIL.COM
3    Vibhor_Singh  20     92        Na  Dehradun          VIBHU@GMAIL.COM
4     Akki Sharma  Na     75  88778988   Lucknow                       NA

In [26]:
df.rename(columns={'Phoneno':'Mobileno','email':'EMAIL'})     #rename is used to change column name

             Name Age  Marks  Mobileno      City                    EMAIL
0  Amandeep_Singh  20     98   9878978   Lucknow       AMANDEEP@GMAIL.COM
1  Srajan_Jaiswal  21     89    787898    Kanpur  JAISWALSRAJAN@GMAIL.COM
2    Aman_Saraogi  19     78   7898789    Jhansi           AMAN@GMAIL.COM
3    Vibhor_Singh  20     92        Na  Dehradun          VIBHU@GMAIL.COM
4     Akki Sharma  Na     75  88778988   Lucknow                       NA

In [27]:
df

             Name Age  Marks   Phoneno      City                    email
0  Amandeep_Singh  20     98   9878978   Lucknow       AMANDEEP@GMAIL.COM
1  Srajan_Jaiswal  21     89    787898    Kanpur  JAISWALSRAJAN@GMAIL.COM
2    Aman_Saraogi  19     78   7898789    Jhansi           AMAN@GMAIL.COM
3    Vibhor_Singh  20     92        Na  Dehradun          VIBHU@GMAIL.COM
4     Akki Sharma  Na     75  88778988   Lucknow                       NA

In [28]:
df.loc[4]

Name       Akki Sharma
Age                 Na
Marks               75
Phoneno       88778988
City           Lucknow
email               NA
Name: 4, dtype: object

In [29]:
df.loc[0:2,'email']

0         AMANDEEP@GMAIL.COM
1    JAISWALSRAJAN@GMAIL.COM
2             AMAN@GMAIL.COM
Name: email, dtype: object

In [30]:
del df['City']

In [31]:
df

             Name Age  Marks   Phoneno                    email
0  Amandeep_Singh  20     98   9878978       AMANDEEP@GMAIL.COM
1  Srajan_Jaiswal  21     89    787898  JAISWALSRAJAN@GMAIL.COM
2    Aman_Saraogi  19     78   7898789           AMAN@GMAIL.COM
3    Vibhor_Singh  20     92        Na          VIBHU@GMAIL.COM
4     Akki Sharma  Na     75  88778988                       NA

In [32]:
df.drop(index=2)    #remove 2 rows

             Name Age  Marks   Phoneno                    email
0  Amandeep_Singh  20     98   9878978       AMANDEEP@GMAIL.COM
1  Srajan_Jaiswal  21     89    787898  JAISWALSRAJAN@GMAIL.COM
3    Vibhor_Singh  20     92        Na          VIBHU@GMAIL.COM
4     Akki Sharma  Na     75  88778988                       NA